platformio/platform-ststm32/misc/svd/STM32WB30_CM4.svd
            <register>
               <name>PDCRD</name>
               <displayName>PDCRD</displayName>
               <description>Power Port D pull-down control           register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD15</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD14</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD13</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD12</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD11</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD10</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD9</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD8</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD7</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD6</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD5</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD4</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>Port D pull-down bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRE</name>
               <displayName>PUCRE</displayName>
               <description>Power Port E pull-up control           register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU4</name>
                     <description>Port E pull-up bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU3</name>
                     <description>Port E pull-up bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU2</name>
                     <description>Port E pull-up bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU1</name>
                     <description>Port E pull-up bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU0</name>
                     <description>Port E pull-up bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCRE</name>
               <displayName>PDCRE</displayName>
               <description>Power Port E pull-down control           register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD4</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD3</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD2</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>Port E pull-down bit y               (y=0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUCRH</name>
               <displayName>PUCRH</displayName>
               <description>Power Port H pull-up control           register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PU3</name>
                     <description>Port H pull-up bit y               (y=0..1)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU1</name>
                     <description>Port H pull-up bit y               (y=0..1)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PU0</name>
                     <description>Port H pull-up bit y               (y=0..1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCRH</name>
               <displayName>PDCRH</displayName>
               <description>Power Port H pull-down control           register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PD3</name>
                     <description>Port H pull-down bit y               (y=0..1)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD1</name>
                     <description>Port H pull-down bit y               (y=0..1)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PD0</name>
                     <description>Port H pull-down bit y               (y=0..1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2CR1</name>
               <displayName>C2CR1</displayName>
               <description>CPU2 Power control register 1</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EWKUP802</name>
                     <description>802.15.4 external wakeup               signal</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLEEWKUP</name>
                     <description>BLE external wakeup signal</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPDS</name>
                     <description>Flash power down mode during LPSleep for               CPU2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPDR</name>
                     <description>Flash power down mode during LPRun for               CPU2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPMS</name>
                     <description>Low-power mode selection for               CPU2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>C2CR3</name>
               <displayName>C2CR3</displayName>
               <description>CPU2 Power control register 3</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0X00008000</resetValue>
               <fields>
                  <field>
                     <name>EIWUL</name>
                     <description>Enable internal wakeup line for               CPU2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>APC</name>
                     <description>Apply pull-up and pull-down               configuration for CPU2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>E802WUP</name>
                     <description>Enable 802.15.4 host wakeup interrupt               for CPU2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EBLEWUP</name>
                     <description>Enable BLE host wakeup interrupt for               CPU2</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP5</name>
                     <description>Enable Wakeup pin WKUP5 for               CPU2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP4</name>
                     <description>Enable Wakeup pin WKUP4 for               CPU2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP3</name>
                     <description>Enable Wakeup pin WKUP3 for               CPU2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP2</name>
                     <description>Enable Wakeup pin WKUP2 for               CPU2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWUP1</name>
                     <description>Enable Wakeup pin WKUP1 for               CPU2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTSCR</name>
               <displayName>EXTSCR</displayName>
               <description>Power status clear register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>C2DS</name>
                     <description>CPU2 deepsleep mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C1DS</name>
                     <description>CPU1 deepsleep mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CRPF</name>
                     <description>Critical Radio system               phase</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C2STOPF</name>
                     <description>System Stop flag for CPU2</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C2SBF</name>
                     <description>System Standby flag for               CPU2</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C1STOPF</name>
                     <description>System Stop flag for CPU1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>C1SBF</name>
                     <description>System Standby flag for               CPU1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CCRPF</name>
                     <description>Clear Critical Radio system               phase</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>C2CSSF</name>
                     <description>Clear CPU2 Stop Standby               flags</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>C1CSSF</name>
                     <description>Clear CPU1 Stop Standby               flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
